Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: Based on that model, this chapter explores the layers of abstraction behind the process of authoring intelligent content.
zh_cn: 基于温的模型，本章探讨了创作智能内容的过程中需要用到的抽象层级。

source: Based on the LwDITA proposed standard, the principles and strategies included in this book can be effective in a variety of authoring environments.
zh_cn: 基于 LwDITA 拟议标准，本书中包含的原则和策略在各种创作环境中都是有效的。

source: Basic functions.
zh_cn: 基本功能s.

source: Basic requirements.
zh_cn: 基本要求.

source: Basic topic components
zh_cn: 基本话题组件

source: Basic topic types
zh_cn: 基本话题类型

source: Be specific.
zh_cn: 解释要明确具体。

source: Be sure to download the latest version, because the developers are constantly updating the Toolkit and, among other things, improving
zh_cn: 一定要下载最新版本的 DITA-OT，因为开发人员在不断更新，提升

source: Because LwDITA has not been approved as an official OASIS standard as of this writing, the components presented in these chapters might change.
zh_cn: 因为在撰写本文时，LwDITA 还没有被批准为正式的 OASIS 标准，所以章节中介绍的组件可能会发生变化。

source: Because of proprietary practices, it would be impractical to poll private companies, government agencies, and non-profit institutions worldwide to tally a number of DITA and XML users.
zh_cn: 由于个人实践的存在，要在全世界范围内投票统计私有公司、政府机构和非营利机构中使用 DITA 和 XML 的用户人数是不现实的。

source: Because the HDITA content components represent a subset of all the available elements in the HTML5 standard1, not all tags that are valid HTML5 are allowed in HDITA (e.g., there's no element to express a level-three heading in HDITA, although it exists in the HTML5 standard).
zh_cn: 因为HDITA内容组件是HTML5标准1中所有可用元素的子集，并不是所有在HTML5中有效的标签都能在HDITA中使用（例如，在HDITA中没有元素来表示三级标题，尽管它在HTML5标准中存在）

source: Because the MDITA components represent a subset of the GitHub Flavored Markdown (GFM) syntax2, not all moves that are valid in GFM or another Markdown flavor are allowed in MDITA extended profile (e.g., there's no ### syntax to express a level-three heading in MDITA extended profile, although it exists in most Markdown flavors).
zh_cn: 因为MDITA组件是GitHub风格的Markdown(GFM) syntax2的一个子集，并非所有在GFM或其他Markdown风格中有效的文步都能用于MDITA扩展配置文件（例如,MDITA扩展配置文件中没有 ### syntax 语法来表示第三级标题，尽管这一语法在大多数Markdown风格中都存在）。

source: Before (or in addition to) taking, say, a Python course out of their disciplinary context, why not send technical communication students to a course covering the mental and metal tools that practitioners in their field value?
zh_cn: 在（或除了）让技术传播专业的学生学习超出他们学科背景的 Python 课程之前，为什么不让他们学习一门同时涉及使用思考工具和物理工具的课程呢？这正好是技术传播从业者所推崇的。

source: Before DQTI, however, there was PQTI. The publication's original title was Producing Quality Technical Information, and it started as an internal IBM handbook of recommendations for content authors and evaluators.
zh_cn: 然而，在 DQTI出现之前，则是PQTI。此书出版时书名为《产出高质量技术信息》，它一开始时作为为IBM内容创作者和评估者提供建议的内部手册。

source: Before I fix the XDITA topic to remove the error messages, I will present the mapping of the XDITA element of topic to the HDITA and MDITA authoring formats.
zh_cn: 在修正上文展示的 XDITA 话题，清除验证错误提示之前，我将展示如何把 XDITA 格式的话题元素映射到 HDITA 和 MDITA 格式上。

source: Before Intelligent Content, There Was the Computer Manual 47 fiction a paragraph might be the main element, in technical information authors required “other means of differentiating information” (p.
zh_cn: 小说的主要元素是段落，而技术信息作者需要“其他区分信息的手段”(p.

source: Before Intelligent Content, There Was the Computer Manual 49
zh_cn: 智能内容出现前,计算机手册占据主导 49

source: Before Intelligent Content, There Was the Computer Manual 53
zh_cn: 智能内容出现前,计算机手册占据主导 53

source: Before Intelligent Content, There Was the Computer Manual 55 needs.
zh_cn: 智能内容出现前,计算机手册占据主导

source: Before LwDITA existed, I presented a preliminary list of those abstractions as they applied to my teaching of DITA XML (Evia et al., 2015).
zh_cn: 在 LwDITA 出现之前，在教授基于 XML 的 DITA 时，我初步列出了自己应用在教学中的抽象概念的列表 (Evia et al., 2015)。

source: Before describing the LwDITA topical conventions and tracking how they evolved from DITA 1.3 elements and produced their own offspring in the LwDITA three core authoring formats, the following section looks at the evolution of DITA as documented in the OASIS public email list and meeting minutes archive.
zh_cn: 在介绍 LwDITA 话题规则，阐述 LwDITA 的元素是如何从 DITA 标准 1.3 版本中的元素演变而来，又是如何在 LwDITA 三种核心写作格式中生成它们自己的后代元素之前，下面一节将先回顾 OASIS 公共电子邮件记录和会议纪要中记录的 DITA 的演变过程。

source: Before getting into the specific tools and rules for creating content, the next section addresses an important authoring difference between DITA XML and some of the LwDITA authoring formats.
zh_cn: 在讨论创建内容的特定工具和规则之前，下一节将讨论DITA XML和一些LwDITA创作格式之间的一个重要创作差异。

source: Before implementing any computing tools or developing automation solutions, a user experimenting with a computational thinking methodology or exploring the benefits of intelligent content must break down the process in a series of abstractions.
zh_cn: 在使用任何计算工具或开发自动化解决方案之前，用户要想试验计算思维方法论或探索智能内容的好处，必须将过程分解为一系列抽象层级。

source: Bellamy et al.
zh_cn: 贝拉米等人

source: Besides the idea of releasing LwDITA as a standard separate from the three versions of DITA 1.3, Priestley was also looking at the possibility of breaking DITA's dependence on XML as its sole language.
zh_cn: 除了将LwDITA作为一个标准发布，与DITA标准1.3版本的三个版本分开之外，普里斯特利还考虑打破 DITA 对 XML（其唯一语言）的依赖。

source: Bloggers and content strategists who want to be able to create and edit content using mobile devices
zh_cn: 希望能够使用移动设备创建和编辑内容的博主和内容策略师

source: Body Components
zh_cn: 主体组件

source: Body and Paragraph
zh_cn: 主体组件和段落组件

source: Body: a container for the main content of a topic.
zh_cn: 主体（body）：包含话题的主要内容。

source: Bold
zh_cn: 粗体

source: Bold, which is used to draw a reader's attention to a phrase without otherwise adding meaning to the content.
zh_cn: 粗体（bold）可以使读者的注意力聚焦到某个短语上，而不会增加额外内容。

source: By 1999, Dave was aware of my participation as IBM's primary representative with the XSLT and CSS standards activities at the World Wide Web Consortium, and I delivered a presentation at a formative meeting in California that forecast the possibility of XML to solve IBM's still-lingering problems with variant tools and markup usage.
zh_cn: 1999年，戴夫知道我作为 IBM 的主要代表参与了万维网联盟关于 XSLT 和 CSS 标准的活动，并在加州一个影响重大的会议上做了一次演讲，预言可以通过使用各种工具和标记，借助 XML 来解决 IBM 目前仍然存在的问题。

source: By simplifying the core “fixed pattern of template” of DITA, LwDITA embarks on a process of genre evolution that empowers entry-level users while keeping its tools to support our human obsession with order and rules.
zh_cn: 通过简化DITA核心“模板的固定模式”，轻量级DITA开启了体裁演进的新征程，使得入门级用户也能轻松使用的同时满足了人类对秩序与规则的痴迷。

source: By writing topics, however, you can make finer-grained distinctions about the type of information that a user can expect than just at the level of the whole document.
zh_cn: 但是，通过编写主题，您可以对用户期望的信息类型进行更细粒度的区分，而不仅仅是文档级别。

source: CREATING INTELLIGENT CONTENT
zh_cn: 创建智能内容

source: CREATING INTELLIGENT CONTENT WITH LIGHTWEIGHT DITA Creating Intelligent Content with Lightweight DITA documents the evolution of the Darwin Information Typing Architecture (DITA) – a widely used open standard for structuring technical content.
zh_cn: 使用轻量 DITA 创建智能内容

source: CREATING INTELLIGENT CONTENT WITH LIGHTWEIGHT DITA
zh_cn: 使用轻量 DITA 创建智能内容

source: Carolyn Miller noted that evolution is not seen “as a mere metaphor or handy analogy for the process of genre change but as a set of ideas that has been central to thinking about cultural change as about biological change” (Miller, 2015, pp.
zh_cn: 卡洛琳·米勒指出，进化“不仅仅是描述体裁变化过程的一个隐喻或一个方便的类比，而是一套将文化变革视为生物进化的重要思想，”（米勒，2015年，第

source: Carroll added that the death of the manual is not the only factor responsible for the disconnect in interests and priorities between academia and industry in technical communication.
zh_cn: 卡罗尔补充到，技术传播领域学界与工业界间的利益与优先级错位，手册的死亡并非是唯一的原因。

source: Carroll admitted that, at a personal level, he shares the feeling of nostalgia over the missing manuals.
zh_cn: 卡罗尔也承认，从个人层面而言，他也同样对手册的消失恋恋不舍。

source: Carroll identified the same pattern of disparities in computing-related fields: “People who build interfaces and build products don't go to ACM (Association for Computing Machinery) conferences like they used to.
zh_cn: 卡罗尔发现计算机相关的领域都存在学界与业界脱节的问题：“开发界面和产品的人不再像以前那样参加ACM(计算机协会)会议。

source: Carroll said he's always elated to see people take his work and incorporate it into their approaches.
zh_cn: 卡罗尔说他非常高兴人们采纳了他的工作，并将其融入到自己的处事方式中去。

source: Carroll's proposed approach was a commitment to “minimizing the obtrusiveness to the learner of training material — hence the term minimalist” (p.7, his emphasis).
zh_cn: Carroll建议的方法是尽可能减少学习者与培训材料之间的障碍 — 由此提出了极简主义的概念” (p.7, his emphasis).

source: Carroll's work on applying principles of minimalism to technical documentation, presented chiefly in his book The Nurnberg Funnel (1990), still resonates with professionals advancing theory and practice related to procedural writing, delivery of instruction, and interface design.
zh_cn: 卡罗尔致力于将极简主义原则应用到文档上这一点在他的《纽伦堡漏斗》（The Nurnberg Funnel） (1990)一书中体现地淋漓尽致, 这与程式化写作、教程和界面设计等领域的专业前沿理论和实践有着共通之处

source: Casual content contributors.
zh_cn: 非正式内容贡献者

source: Chapter 4 identifies additional user types for the three ini- tial authoring formats of LwDITA.
zh_cn: 第四章介绍了 LwDITA 的三种初始创作格式的其他用户类型。

source: Checklists of key points, which are presented at the end of every chapter and then collected at the end of the book.
zh_cn: 重点清单，在每一章的结尾，并汇总在书的结尾处。

source: Chef Pedro and his team can use any text editor to create the HDITA version of the map.
zh_cn: 厨师佩德罗及其团队可以使用任何文本编辑器创建 HDITA 格式的地图。

source: Chef Pedro can work with an information architect or web designer and create a stylesheet to format the default web transformation from the DITA-OT.
zh_cn: 厨师佩德罗可以与信息架构师或网页设计师合作，创建样式表来替代 DITA-OT 生成的网页交付物的默认样式。

source: Chef Pedro has a background in marketing and culinary arts.
zh_cn: 佩德罗学习过市场营销和烹饪艺术，

source: Chef Pedro has been quite successful with his chain of restaurants Sensei Sushi and he has decided to franchise the brand.
zh_cn: 厨师佩德罗的 Sensei Sushi 连锁店经营得非常成功，他决定出售该品牌的特许经营权。

source: Chef Pedro's team could alternatively create the map for the Sensei Sushi brochure in HDITA.
zh_cn: 厨师佩德罗的团队也可以选择用 HDITA 创建 Sensei Sushi 手册的地图。

source: Chef Pedro, like many content owners in this world, has been using Microsoft Word for most of his information products, and the publications department in his company takes some of those Word files and, through long sessions of copy and pasting, produces menus and flyers in Adobe InDesign and maintains the restaurant's website using WordPress.
zh_cn: 厨师佩德罗像世界上许多内容创作者一样，一直在使用 Microsoft Word 来编写他的信息产品。佩德罗公司的出版部门通过漫长的复制和粘贴部分 Word 文件，利用 Adobe InDesign 制作菜单和传单，并用 WordPress 维护餐馆的网站。

source: Chef Pedro, or most likely an information architect or XML professional working for him, can still specialize the LwDITA <topic> into a <recipe>.
zh_cn: 厨师佩德罗（或最有可能是为他工作的信息架构师或XML专业人员）仍然可以将 LwDITA 中的 <topic> 专门化为 <recipe>。

source: Clarity
zh_cn: 明确

source: Coaching: describing steps in a process
zh_cn: 指导：描述流程中的步骤

source: Coaching: describing success conditions Alerting: helping users avoid unwanted outcomes
zh_cn: 指导：描述成功条件 警告：帮助用户规避不良结果

source: Cohen (then a technical writer at IBM) and Cunningham (then a professor of technical and professional writing at Texas Tech University) were quite prescriptive when documenting rhetorical conventions of the manual.
zh_cn: 柯亨（当时是IBM的一技术文档工程师）和坎宁安（当时是德克萨斯理工大学专业技术写作方向的教授）记录手册的修辞惯例相当规范。

source: Collection (Creating or Gathering Content).
zh_cn: 聚合（创建或聚合内容），

source: Combining discourse from the academic and practitioner sides of technical communication, Andersen assembled a “composite and descriptions of the essential stages, key activities, and common deliverables in building a content strategy framework” (2014, p.
zh_cn: 安德森结合技术传播领域学术界和工业界两方面的论述，收集了“构建内容策略框架所需的材料，包括基本阶段、关键活动和一般交付物” (2014, p.

source: Commenting on Wing's model of computational thinking, Guzdial identifies two sets of examples with different goals.
zh_cn: 在评价温的计算机思维模型时，古齐亚尔提出了2种不同的目标， 并给出了例子。

source: Common Structures in Technical Content Before Minimalism
zh_cn: 极简主义之前的通用结构

source: Complete examples.
zh_cn: 完整示例.

source: Completeness
zh_cn: 完整性

source: Completeness.
zh_cn: 完整

source: Computational Thinking and the Evolution of DITA
zh_cn: 计算机思维与 DITA 的发展

source: Computational thinker
zh_cn: 拥有计算机思维的思考者

source: Computational thinking (CT) has been connected in scholarship and media to initiatives for learning to code and programming.
zh_cn: 在学术界和媒体界一提到计算思维（CT），就会联想到编程学习。

source: Computational thinking is the thought processes involved in formulating problems and their solutions so that the solutions are represented in a form that can be effectively carried out by an information-processing agent.
zh_cn: 计算机思维是一种思维过程，涉及如何表述问题和如何解决问题，因此问题的解决方案可以以一种能被信息处理工具有效执行的形式表现出来。

source: Computing is concerned with automating these abstractions.
zh_cn: 计算机关注如何自动化抽象能力。

source: Computing professionals and educators have the responsibility to make computation available to thinkers of all disciplines.
zh_cn: 计算机专业人员和教师有责任让所有学科的学生都学会计算机思维，

source: Concept, task, and reference are, for many authors and their managers, essential to DITA.
zh_cn: 对于许多作者及其管理人员来说，概念（concept）、任务（task）和参考（reference）对于DITA非常重要。

source: Concept: contains background information and examples
zh_cn: 概念（concept）：包含背景信息和示例

source: Concepts and practices from user experience research, content strategy, and usability have made it to the technical communication vocabulary in industry and academia, and undoubtedly paved the way for intelligent content.
zh_cn: 用户体验研究、内容策略和可用性已经成为工业界和学术界都知晓的技术传播概念与实践，这无疑为智能内容铺平了道路。

source: Concise Terms
zh_cn: 简明术语

source: Concreteness
zh_cn: 具体

source: Content components are the building blocks of information products.
zh_cn: 内容组件是信息产品的构建块。

source: Content curators who receive occasional contributions from developers written in Markdown
zh_cn: 偶尔从开发人员那里收到用Markdown编写的贡献的内容管理员

source: Content developers familiar with DITA or XDITA who want to use Markdown as an authoring language on devices that do not support XML editors
zh_cn: 熟悉DITA或XDITA的内容开发人员希望在不支持XML编辑器的设备上使用Markdown作为创作语言

source: Content in DITA is presented as units or individual XML files that conform to pre-established types or models.
zh_cn: DITA 中的内容以单元或独立 XML 文件的形式存在，符合预先建立的类型或模型结构。

source: Content must be consciously designed to support it.
zh_cn: 必须要有意识地设计支持自动化的内容。

source: Content structured with XDITA is also compatible with DITA; i.e., all XDITA topical components share syntax conventions with DITA, and collections of DITA topics can include XDITA files.
zh_cn: 使用XDITA构造的内容也与DITA兼容；例如，XDITA的所有主题组件与DITA都适用相同的语法惯例，XDITA文件能够使用DITA主题集

source: Content units in DITA are expressed using XML elements and can be conditionally processed using metadata attributes.
zh_cn: DITA中的内容单元使用XML元素表示，并且可以使用元数据属性有条件地进行处理。

source: Controls: enables user interfaces for video playback and volume in web- aimed transformations.
zh_cn: 控件（controls）：在网页转换中，提供控制视频重放和视频音量的用户界面。

source: Creating Intelligent Content with Lightweight DITA does not have a reader prerequisite of experience with the DITA standard.
zh_cn: 本书的读者不需要具备使用 DITA 标准的经验。

source: Creating Intelligent Content with Lightweight DITA introduces and analyzes LwDITA as an approach for developing intelligent content.
zh_cn: 本书介绍并分析了可以用于开发智能内容的 LwDITA，

source: Creating structured content: create new content or convert unstructured to structured content.
zh_cn: 创建结构化内容：创建新内容或将非结构化内容转换为结构化内容。

source: Creating the data base (sic).
zh_cn: 创建数据库。

source: Creating unified processes (work flow and governance): define workflow and define governance.
zh_cn: 创建统一的工作流程：定义工作流和管理方法。

source: Creative communicator
zh_cn: 具有创造力的技术传播人员

source: Cross reference: a labeled link to a piece of information.
zh_cn: 交叉引用（cross reference）：链接到某条信息的标签。

source: Current XML (or DITA) users
zh_cn: XML(或DITA)用户

source: DITA 1.3 also includes topic types designed for learning and training projects: learning plan, learning overview, learning content, learning summary, and learning assessment.
zh_cn: DITA 标准1.3版本还包括为学习和培训项目设计的话题类型：学习计划、学习概述、学习内容、学习总结和学习评估。

source: DITA 1.0 was faithful to the IBM original and was intended mainly as a grammar to structure software documentation.
zh_cn: ITA 1.0 忠实于IBM的原始版本，主要构造软件文档的语法。

source: DITA 1.3, in contrast, has users in diverse industries that share a need for structured information and versatile publishing, but do not have a clear need for concept, task, and reference as core content types.
zh_cn: 相比之下，DITA 1.3， 拥有来自不同行业的用户，这些用户都有对结构化信息和通用发布的需求，但是对概念、任务和引用作为核心内容类型的需求并不明确。

source: DITA Content Types: More than Templates
zh_cn: DITA 内容类型：不仅仅是模板而已

source: DITA Maps
zh_cn: DITA 地图

source: DITA and XDITA topic collections can include HDITA topics, and vice versa.
zh_cn: DITA和XDITA主题集合可以包含HDITA主题，反之亦然。

source: DITA classic topic types: concept, task, and reference, constrained to lightweight topic model
zh_cn: DITA 经典话题类型：受限于轻量级话题模型的概念（concept）、任务（task）和引用（reference）

source: DITA consists of a set of design principles for creating “information-typed” modules at a topic level and for using that content in delivery modes such as online help and product support portals on the Web.
zh_cn: DITA 由一组设计原则组成，这些原则可以用于创建主题级别的“信息型“模块，并在交付模式（如网站上的在线帮助和产品支持门户）中使用这些模块。

source: DITA element
zh_cn: DITA元素

source: DITA just encoded some existing writing standards within IBM, for topic orientation and information typing.
zh_cn: DITA只是对IBM现存的写作标准进行编码，用于划分主题和信息类型。

source: DITA terminology has been rich in metaphors and analogies about evolu- tion since its development.
zh_cn: 自 DITA 发展以来，与 DITA 相关的术语中存在着丰富的关于进化的隐喻和类比。

source: DITA terminology has been rich in metaphors and analogies about evolution since its development.
zh_cn: 自 DITA 发展以来，与 DITA 相关的术语中存在着丰富的关于进化的隐喻和类比。

source: DITA topics consist of content units that can be as generic as sets of paragraphs and unordered lists or as specific as sets of instructional steps in a procedure or cautions to be considered before a procedure is performed.
zh_cn: DITA主题由内容单元组成，这些内容单元可以是通用的段落和无序列表集合，也可以是特殊的流程指导步骤或执行前需要考虑的注意事项集合。

source: DITA's “fully tested DTD or schema for XML-based authoring” comes from the Information Typing part of its name.
zh_cn: 达尔文信息类型架构（DITA）“是一种经过充分检验的用于 XML 创作的 DTD 或模式”这一评价源自其名称中的“信息类型”（Information Typing）部分。

source: DITA, Why Go Lightweight?
zh_cn: DITA 为什么走向了轻量之路？

source: DITA, as it evolves as an open standard, needs to address them and learn from its users.
zh_cn: 随着 DITA 发展成为一种开放标准，这些问题需要解决，也需要听取用户的想法。

source: DITA, however, “has evolved substantially since that initial donation to encompass a very wide scope of requirements indeed” (Kimber, 2012, p.
zh_cn: 不过 DITA “自捐赠后，已经有了很大的发展，涵盖了非常广泛的需求”（金柏，2012年，第

source: DITA.
zh_cn: 答案是

source: Data: a generic component for metadata.
zh_cn: 数据（data）：元数据通用组件。

source: Definition list entry: an entry groups a term and its definition.
zh_cn: 定义列表条目（definition list entry）：一个条目包括术语及其定义。

source: Definition list: a list of terms and corresponding definitions.
zh_cn: 定义列表（definition list）：术语和相关定义列表。

source: Definition lists
zh_cn: 定义列表

source: Definition term: the text that is defined in a list entry.
zh_cn: 定义术语（definition term）：列表条目中定义的文本。

source: Definition value: text that provides the description for a term in a list entry.
zh_cn: 定义值（definition value）：列表条目中用于描述某个术语的文本。

source: Definitions and descriptions of the Extensible Markup Language abound in academic and practitioner publications.
zh_cn: XML 的定义和描述在学术界和从业者的书中比比皆是。

source: Deliverables:
zh_cn: 可交付成果：

source: Departments who want to reduce the cost of developing and maintaining style sheets
zh_cn: 希望降低开发和维护样式表成本的部门

source: Derek Ross warns readers about the deceptive simplicity of the terminology for topics in Aristotelian-inspired discourse:
zh_cn: 德里克•罗斯（Derek Ross）警告读者，在亚里士多德启发式话语中，有关主题的术语看似简单实则不然：

source: Description: a statement that describes or contains additional information about an object.
zh_cn: 描述（description）：描述或包含对象的附加信息的语句。

source: Detailing the Task
zh_cn: 给任务填充细节

source: Details about the franchise offer
zh_cn: 购买特许经营权的费用明细

source: Developers and writers in charge of documenting application programming interfaces (APIs) that need to share content with technical publications or marketing content
zh_cn: 需要与技术出版物或市场内容共享内容的应用程序编程接口(APIs)的开发人员和作者

source: Developers who perceive XML as too verbose or even obsolete.
zh_cn: 认为XML过于冗长甚至过时的开发人员。

source: Developing Quality Technical Information
zh_cn: 开发高质量技术信息

source: Developing an information architecture (the content strategy road map): build content models and define metadata that describe the content, define reuse strategy, and define adaptive content strategy.
zh_cn: 开发信息体系结构（内容策略路线图）：建立内容模型，定义描述内容的元数据，定义复用策略，定义自适应内容策略。

source: Developing intelligent content with LwDITA is, thus, the most straightforward application of computational thinking in structured authoring and technical communication.
zh_cn: 因此，使用 LwDITA 开发智能内容是结构化写作和技术传播中对计算机思维最直接的应用。

source: Developing the technology strategy: define technology requirements, evaluate tool options, work with content management system (CMS) integrators to implement the content model, and implement tools.
zh_cn: 制定技术方案：定义技术需求，评估待选工具，与内容管理系统 (CMS) 集成商合作，将内容模型和工具投入使用。

source: Digital citizen
zh_cn: 数字公民

source: Do not assume that a person reading these sections knows anything about the system” (1976, p.
zh_cn: 不要假定读这些章节的人对系统会有所了解。(1976, p.

source: Document architect, who defines and implements document structure
zh_cn: 文档架构师，定义文档结构使之实现并

source: Does DITA Need Tags?
zh_cn: DITA 需要标签吗？

source: Does this mean that authors who want to give LwDITA a try have to memorize and use all those content components?
zh_cn: 这是否意味着想要尝试 LwDITA 的作者必须记住并使用所有的内容组件？

source: During the spring of 2015, some members of the subcommittee seriously considered the DITA-related name of FINCH (Fully Intelligent New Content Hierarchy).
zh_cn: 2015年春天，小组委员会的成员认真考虑了一个能与 DITA 关联起来的名字：FINCH（Fully Intelligent New Content Hierarchy）。

source: ELI Review curriculum to content elements from the DITA standard
zh_cn: DITA标准的内容元素间建立映射

source: Each group had the charge of developing profiles and establishing the essential DITA content and element types required for each industry or sector represented.
zh_cn: 每个小组都要负责撰写简介，并建立自己所代表的行业或部门所需的基本 DITA 内容和元素类型。

source: Each list item will create, when the topic is processed, a bulleted entry.
zh_cn: 在话题处理过程中，每个列表项都将生成一个项目符号条目。

source: Each quadrant involves some decisions for humans behind the content-development process.
zh_cn: 每个象限都包含了内容开发过程中的人类决策。

source: Each term-description group consists of one or more terms (represented by <dt> elements), and one or more descriptions (represented by <dd> elements)” (W3C, 2017).
zh_cn: 每个术语描述组由一个或多个术语 (由<dt>元素表示) 和一个或多个描述 (由<dd>元素表示) 组成”(W3C, 2017)。

source: Each topic is long enough to make sense on its own, but short enough to stick to one point without expanding into other subjects” (Bellamy et al.
zh_cn: 每个话题都要内容充足，能站得住脚跟，同时也要精简干练，只围绕一个中心点展开，而不扩展到其他主题”（贝拉米等，

source: Earlier in this chapter, Figure 2.1 included a modified version of the marinara sauce recipe from Chapter 1.
zh_cn: 在本章的前面，图2.1 包含了第一章意式番茄罗勒酱的改良版本。

source: Early in the document, the authors specified that “this book is to help writers produce quality technical information and to help reviewers judge the results” (Dean et al., 1983, p.
zh_cn: 在文档的开始部分，作者就明确指出“这本书旨在帮助作者产出高质量技术信息并帮助审稿人判断结果”(Dean et al., 1983, p.

source: Ease of use.
zh_cn: 易用、

source: Easy assembly of new specializations from existing section types
zh_cn: 轻松地利用现有类型组合新的专门化话题

source: Easy creation of new specializations by generation from a topic type designed for specifying specializations
zh_cn: 利用专门化的话题类型，轻松创建新的专门化话题

source: Easy out of the box authoring for common topic types
zh_cn: 轻松地创建常见话题类型，开箱即用

source: Easy to find
zh_cn: 易查找

source: Easy to understand
zh_cn: 易理解

source: Easy to use
zh_cn: 易用
